app/views/shared/_product_li.html.erb

	<% if current_user.admin? %>
	 	<% user = User.find(product.user_id) %>
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 1]]