app/controllers/products_controller.rb

  def activate
    product = Product.find(params[:id])
---
SELECT  "products".* FROM "products"  WHERE "products"."id" = ?  ORDER BY created_at DESC LIMIT 1  [["id", 3]]

  def show
    @product = Product.find(params[:id])
    if @product.available == true
	    id = @product.id
	    category1 = @product.category1
	    @other_products = Product.where("category1 == ? AND id != ? AND available == ?",category1,id,true).order("RANDOM()").limit(3)
---
SELECT  "products".* FROM "products"  WHERE "products"."id" = ?  ORDER BY created_at DESC LIMIT 1  [["id", 2]]
SELECT  "products".* FROM "products"  WHERE (category1 == 1 AND id != 2 AND available == 't')  ORDER BY created_at DESC, RANDOM() LIMIT 3

  def create
    @product = current_user.products.build(product_params)
    if @product.save
---
INSERT INTO "products" ("category1", "company_name", "content", "created_at", "link", "photo1_content_type", "photo1_file_name", "photo1_file_size", "photo1_updated_at", "status", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def edit
    @title = "Редактирование"
    @product = Product.find(params[:id])
---
SELECT  "products".* FROM "products"  WHERE "products"."id" = 2  ORDER BY created_at DESC LIMIT 1

  def update
    @product = Product.find(params[:id])
    if @product.update_attributes(product_params)
---
SELECT  "products".* FROM "products"  WHERE "products"."id" = 2  ORDER BY created_at DESC LIMIT 1
UPDATE "products" SET "photo1_file_name" = ?, "photo1_file_size" = ?, "photo1_updated_at" = ?, "updated_at" = ? WHERE "products"."id" = 2  [["photo1_file_name", "cooltext121136173789087.png"], ["photo1_file_size", 7361], ["photo1_updated_at", "2015-07-14 11:23:39.658058"], ["updated_at", "2015-07-14 11:23:40.331493"]]

  def destroy
    @product = Product.find(params[:id])
    @product.destroy
---
SELECT  "products".* FROM "products"  WHERE "products"."id" = 1  ORDER BY created_at DESC LIMIT 1
DELETE FROM "products" WHERE "products"."id" = ?  [["id", 1]]

  def upvote
    @product = Product.find(params[:id])
---
SELECT  "products".* FROM "products"  WHERE "products"."id" = ?  ORDER BY created_at DESC LIMIT 1  [["id", 7]]