app/controllers/static_pages_controller.rb

SELECT  "products".* FROM "products"  WHERE "products"."available" = 't'  ORDER BY created_at DESC, RANDOM() LIMIT 14 OFFSET 0
SELECT COUNT(*) FROM "products"  WHERE "products"."available" = 't'
---
  def home
    @products=Product.where(available: true).order("RANDOM()").limit(1000)
    @products = @products.paginate(page: params[:page],per_page: 14)