app/controllers/users_controller.rb

SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT "products".* FROM "products"  WHERE "products"."user_id" = ?  ORDER BY created_at DESC  [["user_id", 1]]
---
  def show
    @user = User.find(params[:id])
    @products = @user.products.last(100)

SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "products".* FROM "products"   ORDER BY created_at DESC, updated_at DESC LIMIT 100 OFFSET 0
SELECT COUNT(*) FROM "products"
---
  def manage
    @title = "Управление контентом"
    @user = User.find(params[:id])
    if current_user?(@user)
      if current_user.admin?
        @products = Product.order('updated_at DESC').paginate(page: params[:page],per_page: 100)

SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
  def new_post
    @title = "Создать публикацию"
    @user = User.find(params[:id])